// Найти кубы чисел от 1 до N
Console.WriteLine("Введите число ");
int Number = int.Parse(Console.ReadLine());
Console.WriteLine("Введите степень ");
int Stepen = int.Parse(Console.ReadLine());

Console.WriteLine("Ответ " + Math.Pow(Number, Stepen));